app/Controllers/Cliente.php

    public function index()
    {
        $ClienteModel = new \App\Models\ClienteModel();
        $clientes = $ClienteModel->findAll();
---
SELECT *
FROM `CLIENTE`