app/Models/VendaModel.php

SELECT *
FROM `VENDA`
LEFT JOIN `PRODUTO` ON `PRODUTO`.`ID_PRODUTO` = `VENDA`.`ID_PRODUTO`
LEFT JOIN `VENDEDOR` ON `VENDEDOR`.`ID_VENDEDOR` = `VENDA`.`ID_VENDEDOR`
LEFT JOIN `CLIENTE` ON `CLIENTE`.`CPF` = `VENDA`.`CPF_CLIENTE`
---
        public function JoinVenda() {
            $db = db_connect();
            $resultado_com_join = $db->table('VENDA')
                                     ->join('PRODUTO', 'PRODUTO.ID_PRODUTO = VENDA.ID_PRODUTO', 'left')
                                     ->join('VENDEDOR', 'VENDEDOR.ID_VENDEDOR = VENDA.ID_VENDEDOR', 'left')
                                     ->join('CLIENTE', 'CLIENTE.CPF = VENDA.CPF_CLIENTE', 'left')
                                     ->get()
                                     ->getResult();